# **학업 일지**

#### 오늘의 한마디

> **Pandas로 데이터 처리를 하여 Numpy로 자유롭게 이동해야한다.**

## 1. 강의 정리

#### *Pandas 연습을 통한 데이터 처리의 기본개념 숙지*

### 1.1 Pandas

#### 1.1.1 Pandas 기본함수

- Series 생성 (column vector를 표현하는 객체)

In [29]:
import pandas as pd
import numpy as np

# index를 기준으로 series 생성 
a = pd.Series(data=[1,2,3],index=[4,5,6])

# dict를 넣어서 Series 생성
dict1 = {1:2,2:3,3:4}
b = pd.Series(dict1)

# dict데이터를 넣어줄 때, index를 기준으로 Series를 만든다. index값이 없는 경우 NaN으로 할당
c = pd.Series(data=dict1,index=[1,2,3,4,5])
print(a)
print(b)
print(c)

4    1
5    2
6    3
dtype: int64
1    2
2    3
3    4
dtype: int64
1    2.0
2    3.0
3    4.0
4    NaN
5    NaN
dtype: float64

- 추가메모  
`<Series>`.index : index 객체를 만든다.  
`<Series>`.values : ndarray 객체를 만든다.  
원하는 dataframe을 만든 후 ndarray를 가져오는 연습 해보자.
`<Series>`.astype(`<type>`) : Series의 데이터타입을 바꾸어준다. ex) np.float64

- data frame 생성 세 가지 방법

In [3]:
raw_data = {'first_name':['Jason', 'Molly','lina','Jake', 'Amy'],
           'last_name':['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name'])
df
# 인덱스를 사용하여 DataFrame에서 Series 원하는 정도를 추출

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       lina       Ali
3       Jake    Milner
4        Amy     Cooze

In [4]:
# 중복되는 dict를 이용한 dataframe 생성
data2 = {'nevada': {2001: 2.4, 2002:2.9}, "Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pd.DataFrame(data2)

      nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [31]:
df3 = pd.DataFrame(np.arange(16).reshape(4,4), columns=list('abcd'))
df3

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
#  인덱스를 이용하여 추출
df.iloc[:4]

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       lina       Ali
3       Jake    Milner

In [6]:
# 인덱스 값을 이용하여 추출
df.loc[:2]

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       lina       Ali

In [7]:
df.loc[:,['first_name']]

  first_name
0      Jason
1      Molly
2       lina
3       Jake
4        Amy

In [8]:
# DataFrame에서 Series 추출
df.first_name

0    Jason
1    Molly
2     lina
3     Jake
4      Amy
Name: first_name, dtype: object

In [9]:
# Series 가져오기
df['first_name']

0    Jason
1    Molly
2     lina
3     Jake
4      Amy
Name: first_name, dtype: object

In [10]:
# 원하는 크기의 DataFrame 가져오기
df[['first_name','last_name']]

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       lina       Ali
3       Jake    Milner
4        Amy     Cooze

`<dataframe>`.loc[`<name>`] : name까지 가져온다.  
`<dataframe>`.iloc[`<index>`] : index까지 가져온다.

#### 1.1.2 데이터 불러오기

- read_csv  
data frame 형태로 가져온다.

일반적으로 csv형태의 데이터를 부른다. read_csv
Dataframe 객체를 사용하는 경우는 드물다.

#### 1.1.3 데이터 처리

- Series 객체로 DataFrame 객체에 추가시킬 수 있다.

In [11]:
values = pd.Series(data=['M','F'],index=[0,2])
values

0    M
2    F
dtype: object

In [12]:
df['sex'] = values # 값을 추가할 때는 dataframe 변한다.
df

  first_name last_name  sex
0      Jason    Miller    M
1      Molly  Jacobson  NaN
2       lina       Ali    F
3       Jake    Milner  NaN
4        Amy     Cooze  NaN

- 메모리 삭제 (del, drop)

In [13]:
# column으로 데이터 삭제 - 적용안됨
df.drop('sex', axis=1)

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       lina       Ali
3       Jake    Milner
4        Amy     Cooze

In [26]:
# index로 데이터 삭제 - 적용안됨
df.drop([0,2,4])

  first_name last_name  weight
1      Molly  Jacobson     NaN
3       Jake    Milner    64.0

In [14]:
df # drop은 데이터가 변하지 않는다.

  first_name last_name  sex
0      Jason    Miller    M
1      Molly  Jacobson  NaN
2       lina       Ali    F
3       Jake    Milner  NaN
4        Amy     Cooze  NaN

In [15]:
del df['sex'] # del은 df가 변한다.
df

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       lina       Ali
3       Jake    Milner
4        Amy     Cooze

df[:3] : 인덱스로 인식하고 dataframe 가져온다. 인덱스가 숫자일 경우만 적용된다.  
df[`'<column>'`][:3] : 컬럼, index인식
unique() : 중복 제거하여 ndarray로 return

#### 1.1.3 dataframe 연산

- df + df : 인덱스를 기준으로 연산이 수행된다.  
`<df1>`.add(`<df2>`, fill_value=0) : NaN 대신 fill_value값을 넣어준다.

- 데이터가 목표지점에 가까워지도록 선형

- series + df (broadcasting)

#### 1.1.4 dataframe 변경

In [16]:
df.to_csv()

',first_name,last_name\r\n0,Jason,Miller\r\n1,Molly,Jacobson\r\n2,lina,Ali\r\n3,Jake,Milner\r\n4,Amy,Cooze\r\n'

#### 1.1.5 Data Control

In [18]:
df['weight'] = pd.Series([45,54,64,63], index=[0,2,3,4])
df

  first_name last_name  weight
0      Jason    Miller    45.0
1      Molly  Jacobson     NaN
2       lina       Ali    54.0
3       Jake    Milner    64.0
4        Amy     Cooze    63.0

- Data selection (가장 많이 사용하는 기법)

In [23]:
df['weight'] < 50

0     True
1    False
2    False
3    False
4    False
Name: weight, dtype: bool

In [19]:
df[df['weight']>50]

  first_name last_name  weight
2       lina       Ali    54.0
3       Jake    Milner    64.0
4        Amy     Cooze    63.0

In [25]:
df[['last_name','weight']][:2]

  last_name  weight
0    Miller    45.0
1  Jacobson     NaN

`<DataFrame>`[`boolean Series'] : 
`<DataFrame>`[`index_list`,`column_list`] : index와 column으로 dataframe을 구할 때

- Data inplace

 - inplace=true가 들어가면 dataframe에 적용시킨다.  
예시 : drop, map,

#### 1.1.6 유용한 함수

- map, replace, apply, applymap, describe,

In [35]:
s1 = pd.Series(np.arange(10))
s1.head()

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [36]:
# map 데이터 교체 (없는 값은 NaN으로 대체) - dict나 Series데이터로 교체 가능
z = {1: 'A', 2: 'B', 3: 'C'}
s1.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

`<DataFrame>`.`<column>`.map({'male':0},'female':1)

## 2. 피어 세션 정리

#### 2.1 스터디

- 2.1.1 극한을 시작으로 미분부터 GD, SGD까지 개념을 정리한 후 미니배치 GD에 대해서 정리하였다. (발표 : 김준철) 

- 2.1.2 SGD의 모델부터 시작하여 현재쓰이는 optimizer까지 함수마다 미분값을 다루는데 어떤 특징이 있는지 개념에 대해 알아보고 실제 수식을 통해 깊게 이해할 수 있는 시간이었다. (발표: 이주남)

#### 2.2 원하는 진로를 잡고 논문 공부

- Deep Learning : Yann LeCnn, Yoshua Bengio & Geoffrey Hinton
딥러닝에 대한 전반적인 이해를 돕고 AI 논문에 대한 언어 장벽을 없애기 위해 필요하며 발표 예정

## 3. 진행중인 공부 및 신규 공부 목록

- 진행중인 공부  

    - Deep learning 논문 읽고 정리하기
    - AI 기본 수학 : Mathematics for Machine learning - Marc Peter Deisenroth
    - 웹 크롤링 및 데이터 처리 연습 익숙해지기
    - Numpy를 이용하여 프로젝트 하나 진행해보기 (wav파일로 악보를 추출하는 것을 계획중)

- 신규 공부 목록  
 - Numpy, Pandas 연산 반복 학습 하기

- 완료한 공부

## 4. 감사한 일

- 모르는게 많아서 질문이 불친절한데도 불구하고 아는만큼 모두 알려주려는 문영기 조교님에게 감사합니다. 
- 넓은 시야를 가지도록 외부 프로젝트에 대해 언급하고 제안해준 김상현 팀원에게 감사합니다.